#### Numpy 1

In [1]:
import numpy as np
a = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]]).T
mean_a = np.mean(a, 0)
mean_a

array([2. , 8.4])

#### Numpy 2

In [2]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

#### Numpy 3

In [3]:
a_t = a_centered.T
a_centered_sp = np.dot(a_t[0], a_t[1])
a_centered_sp / (a_t.shape[1] - 1)

2.0

#### Numpy 4**

In [4]:
covariance = np.cov(a.T)[0, 1]
covariance

2.0

#### Pandas 1

In [5]:
import pandas as pd
authors = pd.DataFrame({'author_id':[1, 2, 3], 
                        'author_name':['Тургенев', 'Чехов', 'Островский']}, 
                        columns=['author_id', 'author_name'])
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 
                                   'Дворянское гнездо', 'Толстый и тонкий', 
                                   'Дама с собачкой', 'Гроза', 
                                   'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]}, 
                     columns=['author_id', 'book_title', 'price'])
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Pandas 2

In [6]:
authors_price = pd.merge(authors, book, on='author_id')
authors_price.drop(columns=['author_id'], axis=1, inplace=True)
authors_price

  author_name            book_title  price
0    Тургенев           Отцы и дети    450
1    Тургенев                 Рудин    300
2    Тургенев     Дворянское гнездо    350
3       Чехов      Толстый и тонкий    500
4       Чехов       Дама с собачкой    450
5  Островский                 Гроза    370
6  Островский  Таланты и поклонники    290

#### Pandas 3

In [7]:
top5 = authors_price.nlargest(5, 'price')
top5

  author_name         book_title  price
3       Чехов   Толстый и тонкий    500
0    Тургенев        Отцы и дети    450
4       Чехов    Дама с собачкой    450
5  Островский              Гроза    370
2    Тургенев  Дворянское гнездо    350

#### Pandas 4

In [8]:
authors_stat = authors_price['author_name'].value_counts()
authors_stat = authors_price.groupby('author_name').agg({'price':['min', 'max', 'mean']})
authors_stat = authors_stat.rename(columns={'min': 'min_price', 'max': 'max_price', 'mean':'mean_price'})
authors_stat

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургенев          300       450  366.666667
Чехов             450       500  475.000000

#### Pandas 5**

In [9]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
# ?pd.pivot_table
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum)
book_info['мягкая'] = book_info['мягкая'].fillna(0)
book_info['твердая'] = book_info['твердая'].fillna(0)
book_info.to_pickle('book_info.pkl')
book_info2 = pd.read_pickle('book_info.pkl')
book_info.equals(book_info2)

True